# organization-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/organization/organization-api/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-organization-api/runs/run-sYvP57n5xE7CEgHB

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.random_password.password: Refreshing state... [id=none]
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/production-organization-api]
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=s9i8ksfaya]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-organization-api-production]
module.aws_lambda.data.archive_file.default: Refresh complete after 2s [id=e48c590098fe5d3eef88e1ab720b45d9f3f3f341]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-organization-api-production-20230426111311581100000001]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=fd87de08-4d67-4311-9eaa-35b065cf7521:production-organization-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/production-organization-api]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=production-organization-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=pj07qzf]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=x73as0p]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_route.any: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_stage.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_api.default: Drift detected (update)
module.aws_lambda.aws_iam_role.default: Drift detected (update)
module.aws_lambda.aws_lambda_function.default: Drift detected (update)
module.database_user.cockroach_sql_user.default: Drift detected (delete)
╷
│ Warning: Cluster not found
│
│   with module.database_user.cockroach_sql_user.default,
│   on ../../../../../shared/infrastructure/modules/serverless_database_user/resources.tf line 14, in resource "cockroach_sql_user" "default":
│   14: resource "cockroach_sql_user" "default" {
│
│ SQL User's parent cluster with clusterID
│ fd87de08-4d67-4311-9eaa-35b065cf7521 is not found. Removing from state.
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.database_user.cockroach_sql_user.default has been deleted
  - resource "cockroach_sql_user" "default" {
        id         = "fd87de08-4d67-4311-9eaa-35b065cf7521:production-organization-api"
      - name       = "production-organization-api" -> null
      - password   = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "production-organization-api"
        tags                           = {
            "domain"        = "organization"
            "environment"   = "production"
            "resource"      = "organization-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-organization-api"
    }

  # module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "production-organization-api"
      + password   = (sensitive value)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "adbeb013-80ef-4f43-876c-864de1bb0d61" -> "ff5ae7fe-05fa-4091-b129-c6117a0d46bf"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*